#include<stdio.h>
#include<string.h>

// No return, parameter
void summation(int a, int b)
{
    int sum = a+b;
    // return; 
    printf("%d\n",sum);

    // 'printf' এর আগে 'return' করলে মেইন ফাংশনের 
    // যেই লাইন থেকে এই ফাংশনকে কল করা হয়েছিলো 
    // এটা সেখানে চলে যাবে। ৩১ নং লাইন , যেখান থেকে
    // কল করা হয়েছিলো এখন সেখানে চলে যাবে। যেহেতু ৩১ 
    // নং লাইনে এটাকে রিসিভ করার কেউ নেই এবং ফাংশন 
    // নিজেও কিছু রিটার্ন করে না তাই প্রোগ্রাম থেকে বের হয়ে
    // যাবে।
    
    //  এবং এই 'return' এর পরের 
    // লাইন / লাইন গুলোকে ইগ্নোর করবে। 

    // ফাংশনের মধ্যে 'return' করা হলে ফাংশন থেকে বের 
    // হয়ে যায়। লুপের 'break' এর মতো। 
}

int main()
{
    // summation(44,43);
    int x,y;
    scanf("%d %d",&x,&y);
    summation(x,y);
    

    return 0;
}